//: C03:Ex08.cpp
// Напишите программу, в которой используются все триграфы, и проверьте,
// поддерживаются ли они вашим компилятором.
#include <iostream>
using namespace std;

int main() {
	cout << "??=" << endl;
	cout << "\??/" << endl;
	cout << "??'" << endl;
	cout << "??(" << endl;
	cout << "??)" << endl;
	cout << "??!" << endl;
	cout << "??<" << endl;
	cout << "??>" << endl;
	cout << "??-" << endl;
} ///:~