//: EX04:Ex09.cpp
// Создайте файл с функцией f(), которая получает аргумент int и выводит его
// на консоль при помощи функции printf() из файла <stdio.h>. Команда вывода
// имеет вид printf("%d\n", i), где i - выводимое значение. Создайте отдельный
// файл с функцией main(), в котором функция f() объявлялась бы с аргументом
// типа float. Вызовите f() из main(). Попробуйте откомпилировать программу компилятором
// С++ и посмотрите, к чему это приведет. Затем откомпилируйте программу компилятором
// С, скомпонуйте ее и посмотрите, что произойдет при запуске. Объясните, в чем дело.
#include "Ex09.h"

//void f(float f);

int main() {
	f(23.23);
}